#PROBLEM STATEMENT - Joining status depends on the duration to accept an offer?

#Reading the respective csv files and merging them

In [286]:
import pandas as pd
df1 = pd.read_csv('HR_Hiring_details_transaction.csv')
df2 = pd.read_csv('Joining_Status.csv')
df3 = df1.merge(df2)
df4 = df3
#mergeDf=pd.merge(df1,df2,how='outer')

#Creating a panda series showing number of Candidates accepting offer after given number of days

In [287]:
acceptance_count = df4['Duration_to_accept_offer'].value_counts()
daywise_acceptance_count = acceptance_count.sort_index()
# daywise_acceptance_count

#Creating a panda series showing number of candidate joining after accepting offer

In [288]:
joinedCondidate = (df4[(df4['Status']) == 'Joined'])['Duration_to_accept_offer'].value_counts()
finalJoinedCondidate = joinedCondidate.sort_index()

#Concatenating two Series to form a dataframe of desired output

In [306]:
created_df = pd.concat([finalRespondents, finalJoinedCondidate], axis = 1)
desired_op = created_df.set_axis(["Offers_accepted", "Joined_Candidate"], axis=1)
desired_op = desired_op.rename_axis('Duration_to_accept_offer')

#Replacing NaN by 0 in order to get result in %age

In [310]:
Final_op = desired_op.fillna(0)
Final_op.head(10)

                          Offers_accepted  Joined_Candidate
Duration_to_accept_offer
0                                     757             686.0
1                                     843             730.0
2                                     605             473.0
3                                     518             440.0
4                                     475             353.0
5                                     380             302.0
6                                     334             257.0
7                                     265             198.0
8                                     166             114.0
9                                     127             101.0

In [311]:
Final_op.tail(10)

                          Offers_accepted  Joined_Candidate
Duration_to_accept_offer
127                                     2               0.0
129                                     3               2.0
130                                     1               0.0
131                                     1               1.0
140                                     1               1.0
143                                     1               1.0
163                                     1               0.0
181                                     1               0.0
210                                     1               0.0
224                                     1               0.0

#Creating a table showing %age Joining w.r.t duration to accept an offer

In [313]:
Final_op['Joining_Percentage(%)'] = (Final_op['Joined_Candidate']*100)/df6['Offers_accepted']

In [314]:
Final_op

,Offers_accepted,Joined_Candidate,Joining_Percentage(%)
Duration_to_accept_offer,,,
0,757,686.0,90.620872
1,843,730.0,86.595492
2,605,473.0,78.181818
3,518,440.0,84.942085
4,475,353.0,74.315789
...,...,...,...
143,1,1.0,100.000000
163,1,0.0,0.000000
181,1,0.0,0.000000
210,1,0.0,0.000000
224,1,0.0,0.000000